
* ADC values

  Fibretronics wearlink is a string of push button (no) switches individually
  in series with a resistor. When no button is pressed it is open
  circuit. When one button is pressed, the resistance corresponding to that
  key is present between the two feed wires.

  To determine the value for the adc we calculate ideal adc reading based on
  the known/measured resistance per button.

  Additional wrinkles;
  - ADC reference is VBG = 1.2V
  - ADC prescaling = 1/3

  | ! | Key           |       Rk |    Vpin |   Vscaled |     Vadc |     Adc |    A-D% | A+D% |
  |---+---------------+----------+---------+-----------+----------+---------+---------+------|
  | # | KEY_NONE      | 10000000 |   0.023 |  0.007667 |    0.000 |       0 |       0 |    0 |
  | # | KEY_VOLUMEDEC |    10000 |   2.888 |  0.962667 |    0.813 |     694 |     680 |  708 |
  | # | KEY_REWIND    |    20000 |   2.567 |  0.855667 |    0.589 |     503 |     493 |  513 |
  | # | KEY_PLAY      |    47000 |   1.974 |  0.658000 |    0.176 |     150 |     147 |  153 |
  | # | KEY_FORWARD   |    30000 |   2.310 |  0.770000 |    0.410 |     350 |     343 |  357 |
  | # | KEY_VOLUMEINC |     5600 |   3.056 |  1.018667 |    0.930 |     794 |     778 |  810 |
  |---+---------------+----------+---------+-----------+----------+---------+---------+------|
  | $ |               | Rl=70000 | Vcc=3.3 | scale=1/3 | Vref=1.2 | bits=10 | dev=.02 |      |
  #+TBLFM: $4=$Vcc-($Rk/($Rk+$Rl))*$Vcc;%.3f::$5=$Vpin*$scale;%3f::$6=max($Vscaled-($Rk/($Rk+$Rl))*$Vref,0);%.3f::$7=$Vadc/($Vref/2^$bits);%.0f::$8=max($7-($dev*$7),0);%.0f::$9=min($7+($dev*$7),1024);%0.f

